; domain
(define
	(domain HYRULE)
	(:requirements :adl :typing :universal-preconditions)
	(:types 
		actant portal - entity
		location entity prefab - object
		door entrance - portal
		character item - actant
	)
	(:constants )
	(:predicates
		(at ?x - entity ?y - location)
		(has ?x - character ?y - item)
		(leadsto ?x - entrance ?y - location)
		(connected ?x - location ?y - location)
		(closed ?x - entrance)
		(locked ?x - portal)
		(unlocks ?x - item ?y - portal)
		(doorway ?x - location ?y - location)
		(doorbetween ?x - door ?y - location ?z - location)
		(tutorial-has-been-completed)
		
		(player ?x - character)
		(wants-item ?x - character ?y - item)
		(willing-to-give-item ?x - character ?y - item)
		(prefab ?x - object ?y - prefab)
	)

	(:action talk-to
		:parameters (?speaker - character ?hearer - character ?location - location)
		:precondition
			(and
				(player ?speaker)
				(at ?speaker ?location)
				(at ?hearer ?location)
			)
		:effect
			(and
				(player ?speaker)
				(at ?speaker ?location)
				(at ?hearer ?location)
			)
	)

	(:action look-at
		:parameters (?character - character ?entity - entity ?location - location)
		:precondition
			(and
				(player ?character)
				(at ?character ?location)
				(at ?entity ?location)
			)
		:effect
			(and
				(player ?character)
				(at ?character ?location)
				(at ?entity ?location)
			)
	)

	(:action open
		:parameters (?character - character ?entrance - entrance ?location - location)
		:precondition
			(and
				(player ?character)
				(at ?character ?location)
				(at ?entrance ?location)
				(closed ?entrance)
				(not (locked ?entrance))
			)
		:effect
				(not (closed ?entrance))
	)

	(:action close
		:parameters (?character - character ?entrance - entrance ?location - location)
		:precondition
			(and
				(player ?character)
				(at ?character ?location)
				(at ?entrance ?location)
				(not (closed ?entrance))
				(not (locked ?entrance))
			)
		:effect
				(closed ?entrance)
	)

	(:action pickup
		:parameters (?character - character ?item - item ?location - location)
		:precondition
			(and
				(player ?character)
				(at ?character ?location)
				(at ?item ?location)
			)
		:effect
			(and
				(not (at ?item ?location))
				(has ?character ?item)
				(willing-to-give-item ?character ?item)
			)
	)

	(:action drop
		:parameters (?character - character ?item - item ?location - location)
		:precondition
			(and
				(player ?character)
				(at ?character ?location)
				(has ?character ?item)
				(willing-to-give-item ?character ?item)
			)
		:effect
			(and
				(not (has ?character ?item))
				(at ?item ?location)
				(not (willing-to-give-item ?character ?item))
			)
	)

	(:action give
		:parameters (?sender - character ?item - item ?receiver - character ?location - location)
		:precondition
			(and
				(at ?sender ?location)
				(has ?sender ?item)
				(willing-to-give-item ?sender ?item)
				(at ?receiver ?location)
				(not (has ?receiver ?item))
				(wants-item ?receiver ?item)
			)
		:effect
			(and
				(not (has ?sender ?item))
				(not (willing-to-give-item ?sender ?item))
				(not (wants-item ?receiver ?item))
				(has ?receiver ?item)
			)
	)

	(:action move-through-doorway
		:parameters (?character - character ?from - location ?to - location)
		:precondition
			(and
				(player ?character)
				(at ?character ?from)
				(not (at ?character ?to))
				(connected ?from ?to)
				(doorway ?from ?to)
				(not (= ?from ?to))
			)
		:effect
			(and
				(not (at ?character ?from))
				(at ?character ?to)
			)
	)

	(:action move-through-door
		:parameters (?character - character ?from - location ?door - door ?to - location)
		:precondition
			(and
				(player ?character)
				(at ?character ?from)
				(not (at ?character ?to))
				(not (= ?from ?to))
				(connected ?from ?to)
				(doorbetween ?door ?from ?to)
				(not (locked ?door))
			)
		:effect
			(and
				(not (at ?character ?from))
				(at ?character ?to)
			)
	)

	(:action move-through-entrance
		:parameters (?character - character ?from - location ?entrance - entrance ?to - location)
		:precondition
			(and
				(player ?character)
				(at ?character ?from)
				(not (at ?character ?to))
				(not (= ?from ?to))
				(at ?entrance ?from)
				(leadsto ?entrance ?to)
				(not (closed ?entrance))
			)
		:effect
			(and
				(not (at ?character ?from))
				(at ?character ?to)
			)
	)

	(:action unlock-door
		:parameters (?character - character ?key - item ?door - door)
		:precondition
			(and
				(player ?character)
				(locked ?door)
				(has ?character ?key)
				(unlocks ?key ?door)
			)
		:effect
			(and
				(not (locked ?door))
				(not (has ?character ?key))
			)
	)

	(:action unlock-entrance
		:parameters (?character - character ?key - item ?entrance - entrance ?location - location)
		:precondition
			(and
				(player ?character)
				(locked ?entrance)
				(has ?character ?key)
				(unlocks ?key ?entrance)
				(at ?character ?location)
				(at ?entrance ?location)
			)
		:effect
			(and
				(not (locked ?entrance))
				(not (has ?character ?key))
			)
	)

	(:action donothing
		:parameters (?character - character)
		:precondition
			(and
				(player ?character)
			)
		:effect
				(player ?character)
	)

	(:action win-the-game
		:parameters (?character - character)
		:precondition
			(and
				(player ?character)
			)
		:effect
				
	)
)

; problem
(define (problem rob)
(:domain HYRULE)
	(:objects 
		 basemententrance basementexit barentrance barexit hutentrance hutexit forgeentrance forgeexit shopentrance shopexit bankentrance bankexit fortentrance fortexit mansionentrance mansionexit - entrance
		 junkyard docks bar townarch townsquare hut forge shop bank valley fort cliff mansion basement storage - location
		 player wizard orc riddler quartermaster appraiser fortuneteller knight paladin baron baroness governor majordomo blacksmith banker citizenone citizentwo apprentice barkeep sand woods cave town beach junk woodenhouse brickhouse cliffedge woodendoor gate sword shield ring key coins skull candlestick cupcake contract letter tonic flowers lasso openbook pailofwater glassmirror tinymushroom silverbullion cat - prefab
		 arthur mel alli michael ian giovanna james dorian jordan camille phillip avery peter frank roger dave karina matthias oscar - character
		 towngate - door
		 knightsword knightshield rubyring coin humanskull candle lovecontract tastycupcake shinykey loveletter hairtonic bouquet rope book bucket mirror mushroom silver ash basementexitkey basementbucket - item
	)
	(:init
		(at forgeexit forge)
		(at mansionexit mansion)
		(at fortentrance valley)
		(at fortexit fort)
		(at mel bar)
		(at arthur bar)
		(at alli junkyard)
		(at michael hut)
		(at tastycupcake hut)
		(at frank townsquare)
		(at ian fort)
		(at camille fort)
		(at mansionentrance cliff)
		(at barentrance docks)
		(at barexit bar)
		(at basemententrance bar)
		(at basementexit basement)
		(at forgeentrance townarch)
		(at oscar bar)
		(at bankexit bank)
		(at bankentrance townsquare)
		(at shopexit shop)
		(at shopentrance townsquare)
		(at hutexit hut)
		(at hutentrance townarch)
		(at phillip fort)
		(at peter forge)
		(at hairtonic hut)
		(at roger mansion)
		(at rope forge)
		(at bucket fort)
		(at mirror junkyard)
		(at silver bank)
		(at matthias forge)
		(at karina townarch)
		(at dave townsquare)
		(at mushroom docks)
		(at book hut)
		(at avery mansion)
		(at knightsword forge)
		(at giovanna shop)
		(at knightshield shop)
		(at rubyring shop)
		(at james valley)
		(at coin bank)
		(at jordan mansion)
		(at bouquet cliff)
		(at dorian townarch)
		(at shinykey bar)
		(at candle mansion)
		(at humanskull cliff)
		(closed fortentrance)
		(closed shopentrance)
		(closed bankentrance)
		(closed basemententrance)
		(closed barexit)
		(closed forgeentrance)
		(closed hutentrance)
		(closed mansionentrance)
		(connected storage basement)
		(connected docks junkyard)
		(connected valley townsquare)
		(connected townsquare valley)
		(connected townsquare townarch)
		(connected junkyard docks)
		(connected townsquare cliff)
		(connected townarch townsquare)
		(connected basement storage)
		(connected cliff townsquare)
		(connected townarch docks)
		(connected docks townarch)
		(doorbetween towngate townarch townsquare)
		(doorbetween towngate townsquare townarch)
		(doorway townarch docks)
		(doorway docks townarch)
		(doorway basement storage)
		(doorway storage basement)
		(doorway docks junkyard)
		(doorway townsquare valley)
		(doorway junkyard docks)
		(doorway townsquare cliff)
		(doorway valley townsquare)
		(doorway cliff townsquare)
		(has dorian loveletter)
		(has mel basementbucket)
		(has alli ash)
		(has dorian lovecontract)
		(leadsto mansionexit cliff)
		(leadsto fortentrance fort)
		(leadsto fortexit valley)
		(leadsto forgeentrance forge)
		(leadsto forgeexit townarch)
		(leadsto hutentrance hut)
		(leadsto mansionentrance mansion)
		(leadsto shopexit townsquare)
		(leadsto barentrance bar)
		(leadsto shopentrance shop)
		(leadsto barexit docks)
		(leadsto bankentrance bank)
		(leadsto basemententrance basement)
		(leadsto bankexit townsquare)
		(leadsto basementexit bar)
		(leadsto hutexit townarch)
		(locked bankentrance)
		(player arthur)
		(prefab bouquet flowers)
		(prefab hairtonic tonic)
		(prefab loveletter letter)
		(prefab candle candlestick)
		(prefab humanskull skull)
		(prefab lovecontract contract)
		(prefab coin coins)
		(prefab ash cat)
		(prefab bank brickhouse)
		(prefab phillip baron)
		(prefab dave citizenone)
		(prefab townsquare town)
		(prefab peter blacksmith)
		(prefab roger governor)
		(prefab camille baroness)
		(prefab rope lasso)
		(prefab silver silverbullion)
		(prefab tastycupcake cupcake)
		(prefab alli orc)
		(prefab ian quartermaster)
		(prefab michael fortuneteller)
		(prefab mel wizard)
		(prefab arthur player)
		(prefab james riddler)
		(prefab jordan paladin)
		(prefab dorian knight)
		(prefab giovanna appraiser)
		(prefab matthias apprentice)
		(prefab knightshield shield)
		(prefab karina citizentwo)
		(prefab rubyring ring)
		(prefab shop brickhouse)
		(prefab knightsword sword)
		(prefab frank banker)
		(prefab oscar barkeep)
		(prefab avery majordomo)
		(prefab barentrance woodendoor)
		(prefab mansion brickhouse)
		(prefab towngate gate)
		(prefab mansionexit woodendoor)
		(prefab basementexit woodendoor)
		(prefab mirror glassmirror)
		(prefab valley cave)
		(prefab fortexit woodendoor)
		(prefab fortentrance woodendoor)
		(prefab bankexit woodendoor)
		(prefab bankentrance woodendoor)
		(prefab shopexit woodendoor)
		(prefab shopentrance woodendoor)
		(prefab hutexit woodendoor)
		(prefab hutentrance woodendoor)
		(prefab forgeexit woodendoor)
		(prefab forgeentrance woodendoor)
		(prefab shinykey key)
		(prefab junkyard junk)
		(prefab basementexitkey key)
		(prefab docks beach)
		(prefab townarch town)
		(prefab bar woodenhouse)
		(prefab hut woodenhouse)
		(prefab storage brickhouse)
		(prefab mansionentrance woodendoor)
		(prefab basement brickhouse)
		(prefab book openbook)
		(prefab forge woodenhouse)
		(prefab basemententrance woodendoor)
		(prefab basementbucket pailofwater)
		(prefab mushroom tinymushroom)
		(prefab barexit woodendoor)
		(prefab bucket pailofwater)
		(prefab cliff cliffedge)
		(prefab fort brickhouse)
		(unlocks shinykey bankentrance)
		(unlocks basementexitkey basementexit)
		(wants-item arthur loveletter)
		(wants-item ian knightsword)
		(wants-item giovanna hairtonic)
		(wants-item arthur basementexitkey)
		(wants-item arthur shinykey)
		(wants-item arthur ash)
		(wants-item ian knightshield)
		(wants-item arthur lovecontract)
		(wants-item james humanskull)
		(wants-item alli tastycupcake)
		(wants-item james candle)
		(wants-item dorian rubyring)
		(wants-item dorian bouquet)
		(wants-item jordan lovecontract)
		(wants-item jordan loveletter)
		(wants-item james coin)
		(willing-to-give-item arthur ash)
		(willing-to-give-item dorian loveletter)
		(willing-to-give-item dorian lovecontract)
		(willing-to-give-item arthur lovecontract)
		(willing-to-give-item arthur loveletter)
	)
	(:goal
	  (OR
		  (AND
			(has ian knightsword)
			(has ian knightshield)
			(has giovanna hairtonic)
			(has alli tastycupcake)
		  )
		  (AND
			(has ian knightsword)
			(has ian knightshield)
			(has giovanna hairtonic)
			(has jordan loveletter)
			(has dorian rubyring)
			(has jordan lovecontract)
		  )
		  (AND
			(has ian knightsword)
			(has ian knightshield)
			(has giovanna hairtonic)
			(has jordan loveletter)
			(has dorian bouquet)
			(has jordan lovecontract)
		  )
		  (AND
			(has ian knightsword)
			(has ian knightshield)
			(has giovanna hairtonic)
			(has james coin)
			(has james humanskull)
			(has james candle)
		  )
		  (AND
			(has ian knightsword)
			(has ian knightshield)
			(has alli tastycupcake)
			(has jordan loveletter)
			(has dorian rubyring)
			(has jordan lovecontract)
		  )
		  (AND
			(has ian knightsword)
			(has ian knightshield)
			(has alli tastycupcake)
			(has jordan loveletter)
			(has dorian bouquet)
			(has jordan lovecontract)
		  )
		  (AND
			(has ian knightsword)
			(has ian knightshield)
			(has alli tastycupcake)
			(has james coin)
			(has james humanskull)
			(has james candle)
		  )
		  (AND
			(has giovanna hairtonic)
			(has alli tastycupcake)
			(has jordan loveletter)
			(has dorian rubyring)
			(has jordan lovecontract)
		  )
		  (AND
			(has giovanna hairtonic)
			(has alli tastycupcake)
			(has jordan loveletter)
			(has dorian bouquet)
			(has jordan lovecontract)
		  )
		  (AND
			(has giovanna hairtonic)
			(has alli tastycupcake)
			(has james coin)
			(has james humanskull)
			(has james candle)
		  )
		  (AND
			(has james coin)
			(has james humanskull)
			(has james candle)
			(has jordan loveletter)
			(has dorian rubyring)
			(has jordan lovecontract)
			(has alli tastycupcake)
		  )
		  (AND
			(has james coin)
			(has james humanskull)
			(has james candle)
			(has jordan loveletter)
			(has dorian bouquet)
			(has jordan lovecontract)
			(has alli tastycupcake)
		  )
		  (AND
			(has jordan loveletter)
			(has dorian rubyring)
			(has jordan lovecontract)
			(has ian knightsword)
			(has ian knightshield)
			(has james coin)
			(has james humanskull)
			(has james candle)
		  )
		  (AND
			(has jordan loveletter)
			(has dorian bouquet)
			(has jordan lovecontract)
			(has ian knightsword)
			(has ian knightshield)
			(has james coin)
			(has james humanskull)
			(has james candle)
		  )
		  (AND
			(has jordan loveletter)
			(has dorian rubyring)
			(has jordan lovecontract)
			(has giovanna hairtonic)
			(has james coin)
			(has james humanskull)
			(has james candle)
		  )
		  (AND
			(has jordan loveletter)
			(has dorian bouquet)
			(has jordan lovecontract)
			(has giovanna hairtonic)
			(has james coin)
			(has james humanskull)
			(has james candle)
		  )
		  (AND
			(has ian knightsword)
			(has ian knightshield)
			(has giovanna hairtonic)
			(has alli tastycupcake)
			(has jordan loveletter)
			(has dorian rubyring)
			(has jordan lovecontract)
		  )
		  (AND
			(has ian knightsword)
			(has ian knightshield)
			(has giovanna hairtonic)
			(has alli tastycupcake)
			(has jordan loveletter)
			(has dorian bouquet)
			(has jordan lovecontract)
		  )
		  (AND
			(has ian knightsword)
			(has ian knightshield)
			(has giovanna hairtonic)
			(has alli tastycupcake)
			(has james coin)
			(has james humanskull)
			(has james candle)
		  )
		  (AND
			(has ian knightsword)
			(has ian knightshield)
			(has giovanna hairtonic)
			(has jordan loveletter)
			(has dorian rubyring)
			(has jordan lovecontract)
			(has james coin)
			(has james humanskull)
			(has james candle)
		  )
		  (AND
			(has ian knightsword)
			(has ian knightshield)
			(has giovanna hairtonic)
			(has jordan loveletter)
			(has dorian bouquet)
			(has jordan lovecontract)
			(has james coin)
			(has james humanskull)
			(has james candle)
		  )
		  (AND
			(has ian knightsword)
			(has ian knightshield)
			(has alli tastycupcake)
			(has jordan loveletter)
			(has dorian rubyring)
			(has jordan lovecontract)
			(has james coin)
			(has james humanskull)
			(has james candle)
		  )
		  (AND
			(has ian knightsword)
			(has ian knightshield)
			(has alli tastycupcake)
			(has jordan loveletter)
			(has dorian bouquet)
			(has jordan lovecontract)
			(has james coin)
			(has james humanskull)
			(has james candle)
		  )
		  (AND
			(has giovanna hairtonic)
			(has alli tastycupcake)
			(has jordan loveletter)
			(has dorian rubyring)
			(has jordan lovecontract)
			(has james coin)
			(has james humanskull)
			(has james candle)
		  )
		  (AND
			(has giovanna hairtonic)
			(has alli tastycupcake)
			(has jordan loveletter)
			(has dorian bouquet)
			(has jordan lovecontract)
			(has james coin)
			(has james humanskull)
			(has james candle)
		  )
		  (AND
			(has ian knightsword)
			(has ian knightshield)
			(has giovanna hairtonic)
			(has alli tastycupcake)
			(has jordan loveletter)
			(has dorian rubyring)
			(has jordan lovecontract)
			(has james coin)
			(has james humanskull)
			(has james candle)
		  )
		)
	)
)

; plan
1. (pickup arthur shinykey bar)
   deleted: (at shinykey bar)
   added: (has arthur shinykey) (willing-to-give-item arthur shinykey)
   goals met: 0 of 1
2. (open arthur barexit bar)
   deleted: (closed barexit)
   goals met: 0 of 1
3. (move-through-entrance arthur bar barexit docks)
   deleted: (at arthur bar)
   added: (at arthur docks)
   goals met: 0 of 1
4. (move-through-doorway arthur docks junkyard)
   deleted: (at arthur docks)
   added: (at arthur junkyard)
   goals met: 0 of 1
5. (pickup arthur mirror junkyard)
   deleted: (at mirror junkyard)
   added: (has arthur mirror) (willing-to-give-item arthur mirror)
   goals met: 0 of 1
6. (move-through-doorway arthur junkyard docks)
   deleted: (at arthur junkyard)
   added: (at arthur docks)
   goals met: 0 of 1
7. (move-through-doorway arthur docks townarch)
   deleted: (at arthur docks)
   added: (at arthur townarch)
   goals met: 0 of 1
8. (give dorian loveletter arthur townarch)
   deleted: (has dorian loveletter) (willing-to-give-item dorian loveletter) (wants-item arthur loveletter)
   added: (has arthur loveletter)
   goals met: 0 of 1
9. (give dorian lovecontract arthur townarch)
   deleted: (has dorian lovecontract) (willing-to-give-item dorian lovecontract) (wants-item arthur lovecontract)
   added: (has arthur lovecontract)
   goals met: 0 of 1
10. (open arthur hutentrance townarch)
   deleted: (closed hutentrance)
   goals met: 0 of 1
11. (move-through-entrance arthur townarch hutentrance hut)
   deleted: (at arthur townarch)
   added: (at arthur hut)
   goals met: 0 of 1
12. (pickup arthur hairtonic hut)
   deleted: (at hairtonic hut)
   added: (has arthur hairtonic) (willing-to-give-item arthur hairtonic)
   goals met: 0 of 1
13. (pickup arthur tastycupcake hut)
   deleted: (at tastycupcake hut)
   added: (has arthur tastycupcake) (willing-to-give-item arthur tastycupcake)
   goals met: 0 of 1
14. (move-through-entrance arthur hut hutexit townarch)
   deleted: (at arthur hut)
   added: (at arthur townarch)
   goals met: 0 of 1
15. (move-through-door arthur townarch towngate townsquare)
   deleted: (at arthur townarch)
   added: (at arthur townsquare)
   goals met: 0 of 1
16. (open arthur shopentrance townsquare)
   deleted: (closed shopentrance)
   goals met: 0 of 1
17. (move-through-doorway arthur townsquare cliff)
   deleted: (at arthur townsquare)
   added: (at arthur cliff)
   goals met: 0 of 1
18. (pickup arthur bouquet cliff)
   deleted: (at bouquet cliff)
   added: (has arthur bouquet) (willing-to-give-item arthur bouquet)
   goals met: 0 of 1
19. (open arthur mansionentrance cliff)
   deleted: (closed mansionentrance)
   goals met: 0 of 1
20. (move-through-entrance arthur cliff mansionentrance mansion)
   deleted: (at arthur cliff)
   added: (at arthur mansion)
   goals met: 0 of 1
21. (give arthur loveletter jordan mansion)
   deleted: (has arthur loveletter) (willing-to-give-item arthur loveletter) (wants-item jordan loveletter)
   added: (has jordan loveletter)
   goals met: 0 of 1
22. (give arthur lovecontract jordan mansion)
   deleted: (has arthur lovecontract) (willing-to-give-item arthur lovecontract) (wants-item jordan lovecontract)
   added: (has jordan lovecontract)
   goals met: 0 of 1
23. (move-through-entrance arthur mansion mansionexit cliff)
   deleted: (at arthur mansion)
   added: (at arthur cliff)
   goals met: 0 of 1
24. (move-through-doorway arthur cliff townsquare)
   deleted: (at arthur cliff)
   added: (at arthur townsquare)
   goals met: 0 of 1
25. (move-through-door arthur townsquare towngate townarch)
   deleted: (at arthur townsquare)
   added: (at arthur townarch)
   goals met: 0 of 1
26. (give arthur bouquet dorian townarch)
   deleted: (has arthur bouquet) (willing-to-give-item arthur bouquet) (wants-item dorian bouquet)
   added: (has dorian bouquet)
   goals met: 0 of 1
27. (move-through-doorway arthur townarch docks)
   deleted: (at arthur townarch)
   added: (at arthur docks)
   goals met: 0 of 1
28. (move-through-doorway arthur docks junkyard)
   deleted: (at arthur docks)
   added: (at arthur junkyard)
   goals met: 0 of 1
29. (give arthur tastycupcake alli junkyard)
   deleted: (has arthur tastycupcake) (willing-to-give-item arthur tastycupcake) (wants-item alli tastycupcake)
   added: (has alli tastycupcake)
   goals met: 0 of 1
30. (move-through-doorway arthur junkyard docks)
   deleted: (at arthur junkyard)
   added: (at arthur docks)
   goals met: 0 of 1
31. (move-through-doorway arthur docks townarch)
   deleted: (at arthur docks)
   added: (at arthur townarch)
   goals met: 0 of 1
32. (move-through-door arthur townarch towngate townsquare)
   deleted: (at arthur townarch)
   added: (at arthur townsquare)
   goals met: 0 of 1
33. (move-through-entrance arthur townsquare shopentrance shop)
   deleted: (at arthur townsquare)
   added: (at arthur shop)
   goals met: 0 of 1
34. (give arthur hairtonic giovanna shop)
   deleted: (has arthur hairtonic) (willing-to-give-item arthur hairtonic) (wants-item giovanna hairtonic)
   added: (has giovanna hairtonic)
   goals met: 1 of 1
